class HomePageFAQ:
    answer1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    answer2 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    answer3 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    answer4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    answer5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    answer6 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    answer7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    answer8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

class OrderPageData:
    data_sets = {
        'data_set1': {
            'first_name': 'Валентина',
            'last_name': 'Пахатинская',
            'address': 'улица Радио 2',
            'subway_name': 'Рижская',
            'telephone_number': '79161234567',
            'date': '10.12.2024',
            'rental_period': 'двое суток',
            'color': ['black', 'grey'],
            'comment_for_courier': 'Сегодня, завтра',
            'description': 'Корректные данные'
        },
        'data_set2':
            {'first_name': 'Иван',
             'last_name': 'Иванов',
             'address': 'Зубовский бульвар 37',
             'subway_name': 'Черкизовская',
             'telephone_number': '89779876543',
             'date': '09.12.2024',
             'rental_period': 'двое суток',
             'color': ['black', 'grey'],
             'comment_for_courier': 'Позвонить за 5 минут',
             'description': 'Корректные данные'
             },
    }

